console.log('number' + 23 + 32);
// Послідовність операції: 'number' (рядок) + 23 (рядок) + 32 (рядок)
// Результат буде 'number2332'

console.log(41 + 1 + 'number');
// Послідовність операції: 41 (число) + 1 (число) = 42 (число) + 'number' (рядок)
// Результат буде '42number'

console.log(null + 1);
// Послідовність операції: null (відсутність значення) + 1 (число)
// Результат буде 1

console.log('five' + + 'two');
// Послідовність операції: 'five' (рядок) + +'two' (унарний плюс перед 'two' спробує перетворити його в число)
// Результат буде fiveNaN (NaN вийде, бо two не може бути перетворено в число)

console.log(2 && 7);
// Послідовність операції: && - логічний оператор "і", повертає перший неправильний операнд або останній операнд, якщо обидва правильні 
// Результат буде 7 (2 розглядається як true, тому він не є останнім операндом, а 7 - останній операнд, який повертається)

console.log(+'40' + +'2');
// Послідовність операції: унарний плюс перед рядками спробує перетворити їх в числа
// Результат буде 42 бо обидва рядку перетворені в числа та зібрані

console.log('10' - 5 === 6);
// Послідовність операції: '10' (рядок) - 5 (число) = 5
// Результат буде false бо 5 не дорівнює 6

console.log(true + false);
// Послідовність операції: true (булеве значення, true перетворюється в 1) + false (булеве значення, false перетворюється в 0)
// Результатбуде 1 (1 + 0 = 1)

console.log('4px' - 3);
// Послідовність операції: '4px' (рядок) - 3 (число)
// Результат буде NaN бо  неможна відняти число з рядка

console.log('4' - 3);
// Послідовність операції: '4' (рядок) - 3 (число)
// Результат буде 1 (4 перетворено в число та відняте 3)

console.log('2' + 3 ** 2);
// Послідовність операції: '2' (рядок) + (3 ** 2 (число) піднесення до степеня = 9)
// Результат буде 29

console.log(12 / '6');
// Послідовність операції: 12 (число) / '6' (рядок)
// Результат буде 2 (рядок '6' перетворено в число і виконано ділення)

console.log(23 + 42 + 'number');
// Послідовність операції: 23 (число) + 42 (число) = 65 (число) + 'number' (рядок)
// Результат буде '65number' (бо 65 буде перетворено в рядок)

console.log('10' + (5 === 6));
// Послідовність операції: '10' (рядок) + (5 === 6) (булевий вираз)
// Результат буде '10false' (результат булевого виразу (5 === 6) - false - перетворено в рядок і додано до '10')

console.log('number' + 15 + 3);
// Послідовність операції: 'number' (рядок) + 15 (число) + 3 (число)
// Результат буде 'number153' (числа додаються до рядка)

console.log(undefined + 1);
// Послідовність операції: undefined (спеціальне значення) + 1 (число)
// Результат буде NaN (не можна додати число до undefined)

console.log('true' == true);
// Послідовність операції: 'true' (рядок) == true (булеве значення)
// Результат буде false ('true' як рядок не дорівнює true як булеве значення)

console.log(false == 'false');
// Послідовність операції: false (булеве значення) == 'false' (рядок)
// Результат буде false (булеве значення false не дорівнює рядку 'false')

console.log(null == '');
// Послідовність операції: null (спеціальне значення) == '' (порожній рядок)
// Результат буде false (null не дорівнює порожньому рядку)

console.log(3 ** (9 / 3));
// Послідовність операції: 9 / 3 = 3 (число) -> 3 ** 3 = 27 (піднесення до степеня)
// Результатбуде 27 (3 в степені 3)

console.log(!!'false' == !!'true');
// Послідовність операції: !!'false' (булеве значення) == !!'true' (булеве значення)
// Результат буде true (обидва рядки 'false' і 'true' перетворено в булеві значення, обидва - true)

console.log(0 || '0' && 1);
// Послідовність операції: && вищий за пріоритетом від ||
// '0' && 1 = Переводимо '0' в true, 1 теж є true. Результат - 1.
// Перший операнд (0) - false, повертаємо другий операнд - 1.
// Результат: 1 

console.log(1 < 2 < 3);
// Послідовність операції: 1 < 2 = true, true < 3 = true
// Результат буде true

console.log('foo' + + +'bar');
// Послідовність операції: 'foo' + + +'bar' (спроба перетворити 'bar' в число, але це неможливо) 
// Результат буде 'fooNaN'

console.log(3 ** 2 / 3);
// Послідовність операції: 3 ** 2 = 9 (піднесення до степеня) -> 9 / 3 = 3 (ділення)
// Результат буде 3

console.log(1 < 2 > 3);
// Послідовність операції: 1 < 2 = true, true > 3 = false
// Результат буде false

console.log((+null == false) < 1);
// Послідовність операції: Спочатку відбувається порівняння +null з false.
// +null перетворюється у +0, а false перетворюється у 0.
// Порівняння +0 == 0. Обидва значення рівні, тому це true.
// Потім true конвертується в число 1 => 1 < 1 - це false.
// Результат буде false

console.log(false && true || true);
// Послідовність операції: && - логічний оператор "і", || - логічний оператор "або", (false && true = false, false || true = true)
// Результат буде true

console.log(false && (true || true));
// Послідовність операції: true || true = true, false && true = false
// Результат буде false

console.log((+null == false) < 1 ** 5);
// Послідовність операції: (+null == false) = true (+null перетворено в +0, а false перетворюється у 0. Порівняння +0 == 0. Обидва значення рівні, тому це true.)
// Потім виконується операція 1 ** 5, тобто 1 в степені 5, що дорівнює 1 і виходить true (що конвертується в 1)  < 1 - це false.
// Результат буде false